
def calc(a, b, c):
    # 南光工资计算器(适用于P，O序列)
    # 手动输入的数值
    入职应承工资 = a  # 举个例子
    基本工资 = 1920.  # 固定
    岗位工资 = b
    当月上班天数_换算后 = c

    # 开始计算
    加倍后的加班日工资 = (入职应承工资 - 岗位工资 - 基本工资) / (31.75 - 22.0)
    加班工资封顶 = 入职应承工资 - 岗位工资 - 基本工资 + 加倍后的加班日工资 * 2
    超过封顶后的加倍的加班日工资 = 基本工资 / 22.
    基本日工资 = (岗位工资 + 基本工资) / 22.
    是否超过额定天数 = not (当月上班天数_换算后 - 33.75 >= 0)
    if (当月上班天数_换算后 <= 22):
        当月应发工资 = 当月上班天数_换算后 * 基本日工资
    elif (当月上班天数_换算后 <= 33.75):
        当月应发工资 = 岗位工资 + 基本工资 + 加倍后的加班日工资 * (当月上班天数_换算后 - 22)
    else:
        当月应发工资 = 入职应承工资 + 加倍后的加班日工资 * 2

    # 结果输出(说人话)
    print("举个例子")
    v0 = 当月应发工资
    v1 = 超过封顶后的加倍的加班日工资
    v2 = 岗位工资 + 基本工资
    v2_percent = 1 - 加班工资封顶 / 入职应承工资
    v3 = 加倍后的加班日工资 * 2
    v4 = 加倍后的加班日工资 * 3 * 1.5 / 8
    v5 = 入职应承工资 + 加倍后的加班日工资 * 2
    v6 = (入职应承工资)
    print("当月应发工资: {:.2f}元".format(v0))
    print("超过33.75天后，每天能拿的工资: {:.2f}元".format(v1))
    print("上满22天能拿到的工资: {:.2f}元 占比: {:.2f}".format(v2, v2_percent))
    print("请假一天扣的工资: {:.2f}元".format(v3))
    print("请假一晚扣的工资: {:.2f}元".format(v4))
    print("做满33.75天能得到的工资: {:.2f}元".format(v5))
    print("做满31.75天能得到的工资: {:.2f}元".format(v6))

    return [v0, v1, v2, v3, v4, v5, v6]

if __name__ == '__main__':
    calc()
